Masmiseim36/nxpSDK/boards/twrk80f150m/project_template/pin_mux.h
/*
 * Copyright 2018-2019 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTA4 (coord J8), J12[4]/SW2/NMI/TSI0_CH5
  @{ */
#define BOARD_SW2_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_SW2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SW2_PIN 4U     /*!<@brief PORTA pin index: 4 */
                             /* @} */

/*! @name PORTA21 (coord J5), J7[10]/J13[C39]/SW3/FXIO0_D9/LLWU_P21/EWM_IN
  @{ */
#define BOARD_SW3_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_SW3_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SW3_PIN 21U    /*!<@brief PORTA pin index: 21 */
                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

#define PORT_DFER_DFE_11_MASK 0x0800u /*!<@brief Digital Filter Enable Mask for item 11. */
#define PORT_DFER_DFE_12_MASK 0x1000u /*!<@brief Digital Filter Enable Mask for item 12. */
#define PORT_DFER_DFE_13_MASK 0x2000u /*!<@brief Digital Filter Enable Mask for item 13. */

/*! @name PORTD12 (coord F4), D2/LED_J_PTD12
  @{ */
#define BOARD_LED_GREEN_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_GREEN_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_GREEN_PIN 12U    /*!<@brief PORTD pin index: 12 */
                                   /* @} */

/*! @name PORTD13 (coord G3), D3/LED_J_PTD13
  @{ */
#define BOARD_LED_BLUE_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_BLUE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_BLUE_PIN 13U    /*!<@brief PORTD pin index: 13 */
                                  /* @} */

/*! @name PORTD11 (coord E3), D1/LED_J_PTD11
  @{ */
#define BOARD_LED_RED_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_RED_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_RED_PIN 11U    /*!<@brief PORTD pin index: 11 */
                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*! @name PORTE0 (coord B1), U23[7]/QSPI0A_DATA3
  @{ */
#define BOARD_QSPI0A_DATA3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_DATA3_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                      /* @} */

/*! @name PORTE1 (coord C2), U23[6]/QSPI0A_SCLK
  @{ */
#define BOARD_QSPI0A_SCLK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_SCLK_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                     /* @} */

/*! @name PORTE2 (coord C1), U23[5]/QSPI0A_DATA0
  @{ */
#define BOARD_QSPI0A_DATA0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_DATA0_PIN 2U     /*!<@brief PORTE pin index: 2 */
                                      /* @} */

/*! @name PORTE3 (coord D2), U23[3]/QSPI0A_DATA2
  @{ */
#define BOARD_QSPI0A_DATA2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_DATA2_PIN 3U     /*!<@brief PORTE pin index: 3 */
                                      /* @} */

/*! @name PORTE4 (coord D1), U23[2]/QSPI0A_DATA1
  @{ */
#define BOARD_QSPI0A_DATA1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_DATA1_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                      /* @} */

/*! @name PORTE5 (coord E2), U23[1]/QSPI0A_SS0
  @{ */
#define BOARD_QSPI0A_SS0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_SS0_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI0APins(void);

/*! @name PORTE6 (coord E1), U22[7]/QSPI0B_DATA3
  @{ */
#define BOARD_QSPI0B_DATA3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0B_DATA3_PIN 6U     /*!<@brief PORTE pin index: 6 */
                                      /* @} */

/*! @name PORTE7 (coord F3), U22[6]/QSPI0B_SCLK
  @{ */
#define BOARD_QSPI0B_SCLK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0B_SCLK_PIN 7U     /*!<@brief PORTE pin index: 7 */
                                     /* @} */

/*! @name PORTE8 (coord F2), U22[5]/QSPI0B_DATA0
  @{ */
#define BOARD_QSPI0B_DATA0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0B_DATA0_PIN 8U     /*!<@brief PORTE pin index: 8 */
                                      /* @} */

/*! @name PORTE9 (coord F1), U22[3]/QSPI0B_DATA2
  @{ */
#define BOARD_QSPI0B_DATA2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0B_DATA2_PIN 9U     /*!<@brief PORTE pin index: 9 */
                                      /* @} */

/*! @name PORTE10 (coord G2), U22[2]/QSPI0B_DATA1
  @{ */
#define BOARD_QSPI0B_DATA1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0B_DATA1_PIN 10U    /*!<@brief PORTE pin index: 10 */
                                      /* @} */

/*! @name PORTE11 (coord G1), U22[1]/QSPI0B_SS0
  @{ */
#define BOARD_QSPI0B_SS0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0B_SS0_PIN 11U    /*!<@brief PORTE pin index: 11 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI0BPins(void);

#define PORT_DFER_DFE_2_MASK 0x04u /*!<@brief Digital Filter Enable Mask for item 2. */
#define PORT_DFER_DFE_3_MASK 0x08u /*!<@brief Digital Filter Enable Mask for item 3. */
#define PORT_DFER_DFE_4_MASK 0x10u /*!<@brief Digital Filter Enable Mask for item 4. */
#define PORT_DFER_DFE_5_MASK 0x20u /*!<@brief Digital Filter Enable Mask for item 5. */
#define PORT_DFER_DFE_7_MASK 0x80u /*!<@brief Digital Filter Enable Mask for item 7. */

/*! @name PORTD4 (coord A3), J13[A78]/J13[B47]/U2[31]/FBa_AD2/SDRAM_A10
  @{ */
#define BOARD_SDRAM_A10_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A10_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                   /* @} */

/*! @name PORTD3 (coord B3), J13[A77]/J13[B52]/U2[30]/FBa_AD3/SDRAM_A11
  @{ */
#define BOARD_SDRAM_A11_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A11_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                   /* @} */

/*! @name PORTD2 (coord C3), J13[A76]/J13[B35]/U2[29]/FBa_AD4/SDRAM_A12
  @{ */
#define BOARD_SDRAM_A12_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A12_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                   /* @} */

/*! @name PORTC10 (coord C6), J13[A75]/J13[B50]/U2[26]/I2C1_SCL/FBa_AD5/SDRAM_A13
  @{ */
#define BOARD_SDRAM_A13_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A13_PIN 10U    /*!<@brief PORTC pin index: 10 */
                                   /* @} */

