Masmiseim36/nxpSDK/boards/twrk80f150m/project_template/pin_mux.h
/*! @name PORTC13 (coord A6), J13[B78]/U2[45]/FBa_AD26/SDRAM_D26
  @{ */
#define BOARD_SDRAM_D26_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D26_PIN 13U    /*!<@brief PORTC pin index: 13 */
                                   /* @} */

/*! @name PORTC12 (coord B6), J13[B77]/U2[47]/FBa_AD27/SDRAM_D27
  @{ */
#define BOARD_SDRAM_D27_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D27_PIN 12U    /*!<@brief PORTC pin index: 12 */
                                   /* @} */

/*! @name PORTB23 (coord E8), J13[B76]/U2[48]/FBa_AD28/SDRAM_D28
  @{ */
#define BOARD_SDRAM_D28_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D28_PIN 23U    /*!<@brief PORTB pin index: 23 */
                                   /* @} */

/*! @name PORTB22 (coord F8), J13[B75]/U2[50]/FBa_AD29/SDRAM_D29
  @{ */
#define BOARD_SDRAM_D29_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D29_PIN 22U    /*!<@brief PORTB pin index: 22 */
                                   /* @} */

/*! @name PORTB21 (coord F9), J13[B74]/U2[51]/FBa_AD30/SDRAM_D30
  @{ */
#define BOARD_SDRAM_D30_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D30_PIN 21U    /*!<@brief PORTB pin index: 21 */
                                   /* @} */

/*! @name PORTB20 (coord F10), J13[B73]/U2[53]/FBa_AD31/SDRAM_D31
  @{ */
#define BOARD_SDRAM_D31_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D31_PIN 20U    /*!<@brief PORTB pin index: 20 */
                                   /* @} */

/*! @name PORTC16 (coord D5), U2[15]/SDRAM_DQM2
  @{ */
#define BOARD_SDRAM_DQM2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_DQM2_PIN 16U    /*!<@brief PORTC pin index: 16 */
                                    /* @} */

/*! @name PORTC17 (coord C4), J1[8]/U2[39]/SDRAM_DQM3
  @{ */
#define BOARD_SDRAM_DQM3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_DQM3_PIN 17U    /*!<@brief PORTC pin index: 17 */
                                    /* @} */

/*! @name PORTB1 (coord G10), J7[2]/J12[7]/U2[18]/J13[A28]/J13[A37]/FXIO0_D1/FTM1_CH1/SDRAM_RAS/TSI0_CH6
  @{ */
#define BOARD_SDRAM_RAS_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_RAS_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                   /* @} */

/*! @name PORTB2 (coord G9), J7[3]/J12[8]/U2[16]/FXIO0_D2/SDRAM_WE/TSI0_CH7
  @{ */
#define BOARD_SDRAM_WE_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_WE_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void);

/*! @name PORTB5 (coord C11), J13[B59]/J13[C58]/J35[C3]/EMVSIM1_CLK
  @{ */
#define BOARD_SMARTCARD_CLK_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SMARTCARD_CLK_PIN 5U     /*!<@brief PORTB pin index: 5 */
                                       /* @} */

/*! @name PORTB4 (coord B11), J13[C61]/J35[C7]/EMVSIM1_IO
  @{ */
#define BOARD_SMARTCARD_IO_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SMARTCARD_IO_PIN 4U     /*!<@brief PORTB pin index: 4 */
                                      /* @} */

/*! @name PORTB7 (coord E11), J13[C22]/J35[SW1]/U2[11]/EMVSIM1_PD/SDRAM_D22
  @{ */
#define BOARD_SMARTCARD_PD_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SMARTCARD_PD_PIN 7U     /*!<@brief PORTB pin index: 7 */
                                      /* @} */

/*! @name PORTB8 (coord D11), J13[C59]/J35[C2]/U2[10]/EMVSIM1_RST/SDRAM_D21
  @{ */
#define BOARD_SMARTCARD_RST_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SMARTCARD_RST_PIN 8U     /*!<@brief PORTB pin index: 8 */
                                       /* @} */

/*! @name PORTB6 (coord F11), J13[C25]/U7[B2]/U2[13]/EMVSIM1_VCCEN/SDRAM_D23
  @{ */
#define BOARD_SMARTCARD_VCCEN_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SMARTCARD_VCCEN_PIN 6U     /*!<@brief PORTB pin index: 6 */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEMVSIMPins(void);

#define PORT_DFER_DFE_14_MASK 0x4000u /*!<@brief Digital Filter Enable Mask for item 14. */
#define PORT_DFER_DFE_15_MASK 0x8000u /*!<@brief Digital Filter Enable Mask for item 15. */

/*! @name PORTB17 (coord E9), J12[11]/J13[B67]/U2[2]/D13[1]/TSI0_CH10/FBa_AD16/SDRAM_D16/BRD_PAD1
  @{ */
#define BOARD_TSI_ELECTRODE_2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_TSI_ELECTRODE_2_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                         /* @} */

/*! @name PORTB16 (coord B10), J12[10]/J13[B68]/U2[4]/D4[1]/TSI0_CH9/FBa_AD17/SDRAM_D17/BRD_PAD2
  @{ */
#define BOARD_TSI_ELECTRODE_1_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_TSI_ELECTRODE_1_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                         /* @} */

/*! @name PORTD14 (coord G4), D13/TP_LED1RR
  @{ */
#define BOARD_LED_TSI_PAD2_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_TSI_PAD2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_TSI_PAD2_PIN 14U    /*!<@brief PORTD pin index: 14 */
                                      /* @} */

/*! @name PORTD15 (coord H4), D14/TP_LED2RR
  @{ */
#define BOARD_LED_TSI_PAD1_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_TSI_PAD1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_TSI_PAD1_PIN 15U    /*!<@brief PORTD pin index: 15 */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTOUCH_PADsPins(void);

/*! @name ADC0_DM3 (coord K3), R44[2]/POT_5K/ADC0_DM3
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPOTPins(void);

#define PORT_DFER_DFE_8_MASK 0x0100u /*!<@brief Digital Filter Enable Mask for item 8. */
#define PORT_DFER_DFE_9_MASK 0x0200u /*!<@brief Digital Filter Enable Mask for item 9. */

