Masmiseim36/nxpSDK/boards/twrk80f150m/project_template/pin_mux.h
/*! @name PORTD9 (coord A9), J13[A8]/U1[12]/U3[7]/U26[6]/I2C0_SDA
  @{ */
#define BOARD_ACCEL_SDA_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_ACCEL_SDA_PIN 9U     /*!<@brief PORTD pin index: 9 */
                                   /* @} */

/*! @name PORTD8 (coord A10), J13[A7]/U1[11]/U3[8]/U26[4]/I2C0_SCL
  @{ */
#define BOARD_ACCEL_SCL_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_ACCEL_SCL_PIN 8U     /*!<@brief PORTD pin index: 8 */
                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void);

#define PORT_DFER_DFE_8_MASK 0x0100u /*!<@brief Digital Filter Enable Mask for item 8. */
#define PORT_DFER_DFE_9_MASK 0x0200u /*!<@brief Digital Filter Enable Mask for item 9. */

/*! @name PORTD8 (coord A10), J13[A7]/U1[11]/U3[8]/U26[4]/I2C0_SCL
  @{ */
#define BOARD_GYRO_SCL_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_GYRO_SCL_PIN 8U     /*!<@brief PORTD pin index: 8 */
                                  /* @} */

/*! @name PORTD9 (coord A9), J13[A8]/U1[12]/U3[7]/U26[6]/I2C0_SDA
  @{ */
#define BOARD_GYRO_SDA_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_GYRO_SDA_PIN 9U     /*!<@brief PORTD pin index: 9 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGYROPins(void);

#define PORT_DFER_DFE_8_MASK 0x0100u /*!<@brief Digital Filter Enable Mask for item 8. */
#define PORT_DFER_DFE_9_MASK 0x0200u /*!<@brief Digital Filter Enable Mask for item 9. */

/*! @name PORTD8 (coord A10), J13[A7]/U1[11]/U3[8]/U26[4]/I2C0_SCL
  @{ */
#define BOARD_PRESSURE_SCL_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_PRESSURE_SCL_PIN 8U     /*!<@brief PORTD pin index: 8 */
                                      /* @} */

/*! @name PORTD9 (coord A9), J13[A8]/U1[12]/U3[7]/U26[6]/I2C0_SDA
  @{ */
#define BOARD_PRESSURE_SDA_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_PRESSURE_SDA_PIN 9U     /*!<@brief PORTD pin index: 9 */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPRESSUREPins(void);

#define PORT_DFER_DFE_7_MASK 0x80u /*!<@brief Digital Filter Enable Mask for item 7. */

/*! @name USB0_DM (coord H1), U9[2]/K80_USB0_DM
  @{ */
/* @} */

/*! @name USB0_DP (coord H2), U9[1]/K80_USB0_DP
  @{ */
/* @} */

/*! @name VREGIN (coord J2), J22[2]/5V0_VREGIN_K80
  @{ */
/* @} */

/*! @name VOUT33 (coord J1), J25[2]/P3V3_K80_VOUT
  @{ */
/* @} */

/*! @name PORTC19 (coord A4), J28[2]/U5[3]/K80_USB_EN
  @{ */
#define BOARD_USB_PWR_EN_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_USB_PWR_EN_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_USB_PWR_EN_PIN 19U    /*!<@brief PORTC pin index: 19 */
                                    /* @} */

/*! @name PORTC18 (coord B4), J18[2]/U5[4]/K80_USB_FLGA
  @{ */
#define BOARD_USB_FLAG_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_USB_FLAG_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_USB_FLAG_PIN 18U    /*!<@brief PORTC pin index: 18 */
                                  /* @} */

/*! @name PORTA29 (coord H11), Q1[3]/USB_PWROUT
  @{ */
#define BOARD_USB_PWR_STAT_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_USB_PWR_STAT_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_USB_PWR_STAT_PIN 29U    /*!<@brief PORTA pin index: 29 */
                                      /* @} */

/*! @name PORTD7 (coord A1), J13[A56]/U2[37]/USBID/SDRAM_CKE
  @{ */
#define BOARD_USB_ID_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_USB_ID_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_USB_ID_PIN 7U     /*!<@brief PORTD pin index: 7 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void);

#define SOPT5_LPUART1RXSRC_LPUART_RX 0x00u /*!<@brief LPUART1 receive data source select: LPUART1_RX pin */
#define SOPT5_LPUART1TXSRC_LPUART_TX 0x00u /*!<@brief LPUART1 transmit data source select: LPUART1_TX pin */

/*! @name PORTC3 (coord B8), J6[2]/LPUART1_RX/CLKOUT
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_RX_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                       /* @} */

/*! @name PORTC4 (coord A8), J8[2]/J13[A69]/U2[22]/LPUART1_TX/FBa_AD11/SDRAM_A19
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_TX_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name XTAL32 (coord L4), Y2[1]/XTAL32
  @{ */
/* @} */

/*! @name EXTAL32 (coord L5), Y2[2]/EXTAL32
  @{ */
/* @} */

/*! @name PORTA19 (coord K11), Y1[1]/XTAL0
  @{ */
#define BOARD_XTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL0_PIN 19U    /*!<@brief PORTA pin index: 19 */
                               /* @} */

/*! @name PORTA18 (coord L11), Y1[3]/EXTAL0
  @{ */
#define BOARD_EXTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL0_PIN 18U    /*!<@brief PORTA pin index: 18 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCsPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
